In [2]:
import pandas as pd
import numpy as np

In [11]:
df = pd.read_csv("income.csv", names=["name","income"], skiprows=[0])

In [13]:
df  # skip rows [0] -> Name	Monthly Income ($)
 
    # 0	income($)	count <- skips this first heading so skip rows[0]

      name  income
0     5000    4371
1    10000    3295
2    15000    5825
3    20000    6047
4    25000    6097
5    30000    5738
6    35000    6100
7    40000    5720
8    45000    5098
9    50000    4991
10   55000    5152
11   60000    4194
12   65000    4411
13   70000    3709
14   75000    3811
15   80000    3766
16   85000    3565
17   90000    3035
18   95000    2753
19  100000    2644
20  105000    2692
21  110000    2180
22  115000    2278
23  120000    1932
24  125000    1992
25  130000    1656
26  135000    1547
27  140000    1424
28  145000    1342
29  150000    1134
30  155000    1489
31  160000    1006
32  165000    1085
33  170000     784
34  175000     869
35  180000     849
36  185000     730
37  190000     688
38  195000     697
39  200000     508

In [9]:
# outliers Elon musk

In [38]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [39]:
 df.income.quantile(0.75)

7750.0

In [40]:
 df.income.quantile(0.25)

5500.0

In [18]:
 df.income.quantile(0.25, interpolation = 'higher')

6000

In [19]:
 df.income.quantile(0.25, interpolation = 'lower')

5000

In [20]:
 df.income.quantile(0)

4000.0

In [21]:
 df.income.quantile(1)

10000000.0

In [22]:
percentile_99 = df.income.quantile(0.99)

In [23]:
percentile_99

9400479.999999994

In [41]:
df[df.income > percentile_99] # outliers

        name    income
6  Elon Musk  10000000

In [42]:
df_no_outliers = df[df.income <= percentile_99] # no outliers

In [43]:
df_no_outliers # no outliers

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [44]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [28]:
# make sofia income NULL

In [31]:
# df['income'] = np.NaN 

# to make every income col NAN

In [45]:
df['income'][3] = np.NaN

C:\Users\MONISHA JAIN\AppData\Local\Temp\ipykernel_14608\2943373670.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3] = np.NaN

In [46]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [47]:
# Deal with NaN or NULL values 

# we can use Mean or Median for even values or MODE

In [50]:
df.income.mean()

# if we use mean it will do average for every values and gives mean
# It gives so 1.6M 
# to get avg use median which takes 2 middle values and gives avg

1671666.6666666667

In [51]:
df_new_mean_fill_NaN = df.fillna(df.income.mean())

In [52]:
df_new_mean_fill_NaN

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [53]:
# use median

In [54]:
df_new_Median_fill_na = df.fillna(df.income.median())

In [55]:
df_new_Median_fill_na

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0